---
kind: property
id: P:Autodesk.Revit.DB.ImageExportOptions.Zoom
source: html/6ab4f8bb-3abb-8c49-eefd-642e9d57a262.htm
---
# Autodesk.Revit.DB.ImageExportOptions.Zoom Property

The value for Zoom (as a percentage). Used only when ZoomType is Zoom.

## Syntax (C#)
```csharp
public int Zoom { get; set; }
```

## Remarks
The default is 50.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The Zoom value is outside the permitted range.